fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>450</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОписаниеПеременных

//ВКМ -  Переменные для хранения состояния документа до записи
Перем ВКМ_НовыйДокумент;
Перем ВКМ_ИсходныеДанные;

#КонецОбласти

#Область ОбработчикиСобытий

//ВКМ - Проверка: создание нового документа или изменение старого 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ВКМ_НовыйДокумент = ЭтоНовый();
	
	//ВКМ - Фиксируем исходные данные документа, при его редактировании
	Если Не ВКМ_НовыйДокумент Тогда
		ВКМ_ИсходныеДанные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
								Ссылка, "Специалист, ДатаПроведенияРабот, ВремяНачалаРабот, ВремяОкончанияРабот");
	КонецЕсли;
	
КонецПроцедуры

//ВКМ - Создание уведомлений
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Уведомить = Ложь;
	Текст   = "";
	
	Если ВКМ_НовыйДокумент Тогда
		Уведомить = Истина;
		Текст   = "Назначена новая заявка.";
	ИначеЕсли ВКМ_ИсходныеДанные <> Неопределено Тогда
		
		Если Специалист <> ВКМ_ИсходныеДанные.Специалист 
			Или ДатаПроведенияРабот <> ВКМ_ИсходныеДанные.ДатаПроведенияРабот
			Или ВремяНачалаРабот <> ВКМ_ИсходныеДанные.ВремяНачалаРабот
			Или ВремяОкончанияРабот <> ВКМ_ИсходныеДанные.ВремяОкончанияРабот Тогда
			
			Уведомить = Истина;
			Текст   = "Параметры заявки (дата/время/специалист) изменены.";
		КонецЕсли;
	КонецЕсли;
	
	Если Уведомить Тогда
		ВКМ_ЗаписатьВСправочникУведомлений(Текст);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//ВКМ - Проверка на корректность даты документа и типа указанного договора (По заданию сказано реализовать это в обработке проведения).
	
	ИнформацияОДоговоре = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор,"ВидДоговора, ВКМ_ДатаНачала, ВКМ_ДатаОкончания, ВКМ_СтоимостьЧасаРаботы");
	Абонентскийдоговор = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");
	Если НЕ ИнформацияОДоговоре.ВидДоговора = Абонентскийдоговор Тогда
		ОбщегоНазначения.СообщитьПользователю(
				"Выбранный договор не является договором абонентского обслуживания. Проведение невозможно!", , "Договор", , Отказ);
	КонецЕсли;
	
	
			
	Если ИнформацияОДоговоре.ВидДоговора = Абонентскийдоговор И 
		(Дата < ИнформацияОДоговоре.ВКМ_ДатаНачала Или Дата > ИнформацияОДоговоре.ВКМ_ДатаОкончания) Тогда
			ТекстОшибки = СтрШаблон("Дата документа не соответствует периоду действия договора (%1 - %2)!", 
				Формат(ИнформацияОДоговоре.ВКМ_ДатаНачала, "ДЛФ=D"), 
				Формат(ИнформацияОДоговоре.ВКМ_ДатаОкончания, "ДЛФ=D"));
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Дата", , Отказ);
		КонецЕсли;

	
	//ВКМ - Запись движений
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Очистить();
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка КАК Ссылка,
		|	СУММА(ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту) КАК ЧасыКОплатеКлиенту,
		|	ВКМ_ОбслуживаниеКлиента.Дата КАК Дата,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДатаНачала КАК ДоговорВКМ_ДатаНачала,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДатаОкончания КАК ДоговорВКМ_ДатаОкончания,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора КАК ДоговорВидДоговора,
		|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
		|	ЕСТЬNULL(ВложенныйЗапрос.ПроцентОтРабот, -1) КАК ПроцентОтРабот
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
		|				ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
		|			ИЗ
		|				РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, Сотрудник = &Специалист) КАК
		|					ВКМ_УсловияОплатыСотрудниковСрезПоследних) КАК ВложенныйЗапрос
		|			ПО ВКМ_ОбслуживаниеКлиента.Специалист = ВложенныйЗапрос.Сотрудник
		|		ПО ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = ВКМ_ОбслуживаниеКлиента.Ссылка
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка,
		|	ВКМ_ОбслуживаниеКлиента.Дата,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДатаНачала,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДатаОкончания,
		|	ВКМ_ОбслуживаниеКлиента.Специалист,
		|	ЕСТЬNULL(ВложенныйЗапрос.ПроцентОтРабот, -1)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Специалист", Специалист);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Если ВыборкаДетальныеЗаписи.ПроцентОтРабот = -1 Тогда
			ТекстСообщения = СтрШаблон("Для сотрудника %1 не заданы условия оплаты!", Специалист);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
			Возврат;
		КонецЕсли;

		ДвижениеКлиент = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		ДвижениеКлиент.Период = Дата;
		ДвижениеКлиент.Клиент = Клиент;
		ДвижениеКлиент.Договор = Договор;
		ДвижениеКлиент.КоличествоЧасов = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту;
		ДвижениеКлиент.СуммаКОплате = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту
			* ИнформацияОДоговоре.ВКМ_СтоимостьЧасаРаботы;

		Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Специалист;
		Движение.ЧасовКОплате = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = (ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту * ИнформацияОДоговоре.ВКМ_СтоимостьЧасаРаботы * ВыборкаДетальныеЗаписи.ПроцентОтРабот) / 100;
	КонецЦикла;
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//ВКМ - Запись изменений по документу в справочник
Процедура ВКМ_ЗаписатьВСправочникУведомлений(Текст)
	
	ШаблонСообщения = "%1
	|----------------------------------
	|Специалист: %2
	|**********************************
	|Клиент: %3
	|**********************************	
	|Дата: %4
	|**********************************
	|Время начала работ: 	 %5 
	|**********************************
	|Время окончания работ:  %6
	|----------------------------------";
	
	ТекстСообщения = СтрШаблон(ШаблонСообщения,
		Текст, Строка(Специалист), Строка(Клиент),
		Формат(ДатаПроведенияРабот, "ДЛФ=D"),
		Формат(ВремяНачалаРабот, "ДЛФ=T"),
		Формат(ВремяОкончанияРабот, "ДЛФ=T"));
		
	НовоеУведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
	НовоеУведомление.ВКМ_ТекстСообщения = ТекстСообщения;
	НовоеУведомление.Записать();
	
КонецПроцедуры

#КонецОбласти
#КонецЕсли
